# Python Basics on Pandas

-  pandas is a library use to manipulate the data frame

In [1]:
# importing the pandas

import pandas as pd

In [2]:
# importing the dataset
cr = pd.read_csv(r"O:\IMARTICUS LECTURES\Python\Pandas Data Set\CreditRisk.csv")
cr

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
976,LP002971,Male,Yes,4.0,Not Graduate,Yes,4009,1777.0,113.0,360.0,1.0,Urban,Y
977,LP002975,Male,Yes,0.0,Graduate,No,4158,709.0,115.0,360.0,1.0,Urban,Y
978,LP002980,Male,No,0.0,Graduate,No,3250,1993.0,126.0,360.0,NaN,Semiurban,Y
979,LP002986,Male,Yes,0.0,Graduate,No,5000,2393.0,158.0,360.0,1.0,Rural,N
980,LP002989,Male,No,0.0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,Y

In [3]:
cr.head() 
# shows top 5 rows

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
cr.tail()
# shows last 5 rows

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
976,LP002971,Male,Yes,4.0,Not Graduate,Yes,4009,1777.0,113.0,360.0,1.0,Urban,Y
977,LP002975,Male,Yes,0.0,Graduate,No,4158,709.0,115.0,360.0,1.0,Urban,Y
978,LP002980,Male,No,0.0,Graduate,No,3250,1993.0,126.0,360.0,NaN,Semiurban,Y
979,LP002986,Male,Yes,0.0,Graduate,No,5000,2393.0,158.0,360.0,1.0,Rural,N
980,LP002989,Male,No,0.0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,Y

In [5]:
cr.shape
# shows no of rows and columns

(981, 13)

In [6]:
cr.shape[0]
# gives only count of rows

981

In [ ]:
cr.shape[1]
# gives only count of columns

In [7]:
# for getting all the names of columns

cr.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [8]:
# to select the column
cr.ApplicantIncome

0      5849
1      4583
2      3000
3      2583
4      6000
       ...
976    4009
977    4158
978    3250
979    5000
980    9200
Name: ApplicantIncome, Length: 981, dtype: int64

In [9]:
# to find mean, median, skewness, kurtosis, std, var, min, max of specific column

cr.ApplicantIncome.mean()

5179.795107033639

In [10]:
cr.ApplicantIncome.median()

3800.0

In [11]:
cr.ApplicantIncome.skew()

7.086961153594506

In [13]:
cr.ApplicantIncome.kurtosis() + 3

# Kurtosis --->  when actual kurtosis is 3 then in python it is shown as zero (as default) so add + 3

74.40205531120817

In [14]:
cr.ApplicantIncome.std()

5695.104532539108

In [15]:
cr.ApplicantIncome.var()

32434215.636547495

In [16]:
# other way to select the column

cr['ApplicantIncome']

0      5849
1      4583
2      3000
3      2583
4      6000
       ...
976    4009
977    4158
978    3250
979    5000
980    9200
Name: ApplicantIncome, Length: 981, dtype: int64

In [17]:
# other way to calcuate mean and other 

cr['ApplicantIncome'].mean()

5179.795107033639

In [18]:
# how many unique values are there in column 

cr.Property_Area.unique()

array(['Urban', 'Rural', 'Semiurban'], dtype=object)

In [19]:
# by using n infront of unique we will get count of unique values
cr.Property_Area.nunique()

3

In [21]:
# using the value_counts function 
# using value_counts() we get the total number of counts of each records

cr.Property_Area.value_counts()

Semiurban    349
Urban        342
Rural        290
Name: Property_Area, dtype: int64

In [22]:
cr.Gender.value_counts()

Male      775
Female    182
Name: Gender, dtype: int64

In [24]:
cr.Self_Employed.value_counts()

No     807
Yes    119
Name: Self_Employed, dtype: int64

In [26]:
cr.Education.value_counts()

Graduate        763
Not Graduate    218
Name: Education, dtype: int64

In [27]:
cr.Loan_Status.value_counts()

Y    712
N    269
Name: Loan_Status, dtype: int64

In [25]:
cr.Married.value_counts()

Yes    631
No     347
Name: Married, dtype: int64

In [28]:
cr.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0.0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0.0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [30]:
# using groupby function on aggregates
# here Education is a column name

cr.groupby('Education').ApplicantIncome.mean().round(2) # used round at last to get limited decimals

# here we understand that mean of graduates are more than not grad

Education
Graduate        5602.44
Not Graduate    3700.54
Name: ApplicantIncome, dtype: float64

In [31]:
# calculating the median using groupby

cr.groupby("Education").ApplicantIncome.median()

Education
Graduate        4000.0
Not Graduate    3333.0
Name: ApplicantIncome, dtype: float64

In [32]:
# calculating the mean as per gender for income

cr.groupby('Gender').ApplicantIncome.mean().round(2)

Gender
Female    4458.91
Male      5256.93
Name: ApplicantIncome, dtype: float64

In [33]:
cr.groupby('Gender').ApplicantIncome.median().round(2)

Gender
Female    3634.5
Male      3865.0
Name: ApplicantIncome, dtype: float64

In [35]:
# taking out the max value from each gender 

cr.groupby('Gender').ApplicantIncome.max()

Gender
Female    19484
Male      81000
Name: ApplicantIncome, dtype: int64

In [36]:
# using groupby function on more than 1 column

cr.groupby(['Gender', 'Education']).ApplicantIncome.mean().round(2) # for more than 1 column use []

Gender  Education
Female  Graduate        4598.18
        Not Graduate    3852.68
Male    Graduate        5725.89
        Not Graduate    3695.45
Name: ApplicantIncome, dtype: float64

In [38]:
# using groupby function on more than 2 columns

cr.groupby (['Gender', 'Education', 'Self_Employed']).ApplicantIncome.mean().round(2)

Gender  Education     Self_Employed
Female  Graduate      No                4337.03
                      Yes               7810.07
        Not Graduate  No                2826.89
                      Yes              11609.25
Male    Graduate      No                5380.69
                      Yes               7350.51
        Not Graduate  No                3589.13
                      Yes               4484.70
Name: ApplicantIncome, dtype: float64

In [41]:
# using groupby function on 4 columns

cr.groupby (['Gender', 'Education', 'Self_Employed', 'Married']).ApplicantIncome.mean().round(2)

Gender  Education     Self_Employed  Married
Female  Graduate      No             No          4211.24
                                     Yes         4449.34
                      Yes            No          6722.25
                                     Yes        12161.33
        Not Graduate  No             No          2815.37
                                     Yes         2851.22
                      Yes            No         13098.33
                                     Yes         7142.00
Male    Graduate      No             No          4866.78
                                     Yes         5590.77
                      Yes            No          8197.53
                                     Yes         7097.89
        Not Graduate  No             No          3500.08
                                     Yes         3619.62
                      Yes            No          4251.17
                                     Yes         4584.79
Name: ApplicantIncome, dtype: float64